quiz/src/DataProcessors/ИграВКвиз/ИграВКвиз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИграВКвиз</name>
  <attributes>
    <name>Квиз</name>
    <type>
      <types>DocumentRef.Квиз</types>
    </type>
  </attributes>
  <attributes>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Команды</types>
    </type>
  </attributes>
  <attributes>
    <name>Раунд</name>
    <type>
      <types>CatalogRef.Раунды</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

quiz/src/InformationRegisters/РезультатыКвиза/РезультатыКвиза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыКвиза</name>
  <resources>
    <name>Ответ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Принят</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Квиз</name>
    <type>
      <types>DocumentRef.Квиз</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Команды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Раунд</name>
    <type>
      <types>CatalogRef.Раунды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вопрос</name>
    <type>
      <types>CatalogRef.Вопросы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

quiz/src/DataProcessors/ИграВКвиз/Forms/ФормаКоманды/Module.bsl
&НаСервере
Процедура КомандаПриИзмененииНаСервере()
	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)  
	
	//МассивПараметровВыбора = Новый Массив;
	//МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Проведен",Ложь));
	//НовыеПараметрыВыбора =  Новый ФиксированныйМассив(МассивПараметровВыбора);
	//Элементы.Квиз.ПараметрыВыбора = НовыеПараметрыВыбора;   
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МассивПараметровВыбора = Новый Массив;
	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Капитан", ПользователиКлиент.ТекущийПользователь()));
	НовыеПараметрыВыбора =  Новый ФиксированныйМассив(МассивПараметровВыбора);
	Элементы.Команда.ПараметрыВыбора = НовыеПараметрыВыбора;

КонецПроцедуры

&НаСервере
Процедура КвизПриИзмененииНаСервере()
	
	Раунды.Параметры.УстановитьЗначениеПараметра("Квиз", Объект.Квиз);
	
КонецПроцедуры

&НаКлиенте
Процедура КвизПриИзменении(Элемент)
	
	КвизПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РаундыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Раунды.ТекущиеДанные;   
	Если ТекущиеДанные.Активность Тогда
		ЗаполнитьВопросы(ТекущиеДанные.Раунд);
		Объект.Раунд = ТекущиеДанные.Раунд;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВопросы(Раунд);
 Ответы.Загрузить(Раунд.Вопросы.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОтветы(Команда)
	ЗаписатьОтветыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОтветыНаСервере()
	
	СтрокаРаунда = Объект.Квиз.Раунды.Найти(Объект.Раунд); 
	Если СтрокаРаунда.Активность = Истина Тогда
		РегистрыСведений.РезультатыКвиза.ЗаписатьРезультатыРаунда(Объект.Квиз,Объект.Раунд,Ответы.Выгрузить());
	Иначе
		ВызватьИсключение("Раунд завершен. Ответы не принимаются");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветыОтветПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Ответы.ТекущиеДанные;
	ТекущиеДанные.Команда = Объект.Команда;
	ТекущиеДанные.Принят = ОтветВерный(ТекущиеДанные.Вопрос,ТекущиеДанные.Ответ);
КонецПроцедуры

Функция ОтветВерный(Вопрос,Ответ)
	Возврат Вопрос.ЭталонныйОтвет = Ответ;
КонецФункции
